{"course": [{"course": "example-1n00", "duration": "January 10th 2022 to April 08th 2022", "term": "Fall/Winter", "section": 0.0, "description": "COSC 4P02, Software Engineering 2, is a fourth year course described as: “Application of software engineering. The development of a large-scale software engineering project in a competitive team setting, including creation of complete documentation for a working system”. It is formatted as Lecture/Instructor Consultation and Individual work, 6 hours per week. Restrictions are open to COSC (single or combined), BCB and CAST majors with a minimum of 14.0 overall credits, has the prerequisite(s) of COSC 4P01 (minimum 60 percent), Completion of this course will replace previous assigned grade and credit obtained in COSC 4F00 and is noted to be Open only to majors. Click on course name to see restriction for list. Must hold a minimum of 14.0 overall credits. This course may be offered in multiple modes of delivery. The method of delivery will be listed on the academic timetable, in the applicable term. The course runs from January 10th 2022 to April 08th 2022, on Mondays and Fridays from 1630 to 1800 in South Block 216. This course is taught by instructor Naser Ezzati-Jivan. This course has only one section.", "location": "Online", "lab": "COSC 4P14, Computer Networks, has 4 labs in section 1. Lab 1 runs Fridays from 1100 to 1300 at Mackenzie Chown J room 327. Lab 2 runs Tuesdays from 1100 to 1300 at Mackenzie Chown J room 327. Lab 3 runs Wednesdays from 1000 to 1300 at Mackenzie Chown J room 327. Lab 4 runs Thursdays from 900 to 1100 at Mackenzie Chown J room 327. This course has only one section.", "time": "1630-1800", "title": "Software Engineering 1", "format": "Lectures/seminar/lab, 5 hours per week.", "prerequisites": "COSC 1P02 (minimum 60 percent) or permission of the Chair.", "exclusions": "None", "restriction": "None", "note": "None", "website": "https://brocku.ca/webcal/2021/undergrad/cosc.html#COSC_4P02", "professor": "Ezzati-Jivan, Naser", "exam location": "Ian D Beddis Gymnasium", "exam time": "in-person on July 4th at 16:30"}, {"course": "cosc-4p01", "duration": "Sep 08, 2021 to Dec 07, 2021", "term": "Fall/Winter", "section": 1.0, "description": "Theory of software engineering. Topics include plan-driven development, Agile development, software requirements elicitation and presentation, verification of software correctness, redundancy, robustness, safety and security. Creation of robust software requirements document. Introduction to tools such as Git and Azure DevOps.", "location": "STH216 — South Block (formerly AS216)", "lab": "None", "time": "1630-1800", "title": "Software Engineering 1", "format": "Lecture/Instructor Consultation and Individual work, 6 hours per week.", "prerequisites": "open to COSC (single or combined), BCB and CAST majors with a minimum of 14.0 overall credits.", "exclusions": "Completion of this course will replace previous assigned grade and credit obtained in COSC 4F00.", "restriction": "open to COSC (single or combined), BCB and CAST majors with a minimum of 14.0 overall credits.", "note": "Open only to majors. See course description for re strictions list. Must hold a minimum of 14.0 overall credits. this course may be offered in multiple modes of delivery. The method of delivery will be listed on the academic timetable, in the applicable term.", "website": "https://brocku.ca/webcal/2021/undergrad/cosc.html#COSC_4P01", "professor": "Ezzati-Jivan, Naser", "exam location": "None", "exam time": "None"}, {"course": "cosc-4p02", "duration": "Jan 10, 2022 to Apr 08, 2022", "term": "Fall/Winter", "section": 1.0, "description": "Application of software engineering. The development of a large-scale software engineering project in a competitive team setting, including creation of complete documentation for a working system.", "location": "STH216 — South Block (formerly AS216)", "lab": "None", "time": "1630-1800", "title": "Software Engineering 2", "format": "Lecture/Instructor Consultation and Individual work, 6 hours per week.", "prerequisites": "Prerequisite(s): COSC 4P01 (minimum 60 percent).", "exclusions": "Completion of this course will replace previous assigned grade and credit obtained in COSC 4F00.", "restriction": "open to COSC (single or combined), BCB and CAST majors with a minimum of 14.0 overall credits.", "note": "Open only to majors. See course description for re strictions list. Must hold a minimum of 14.0 overall credits. this course may be offered in multiple modes of delivery. The method of delivery will be listed on the academic timetable, in the applicable term.", "website": "https://brocku.ca/webcal/2021/undergrad/cosc.html#COSC_4P02", "professor": "Ezzati-Jivan, Naser", "exam location": "None", "exam time": "None"}], "program": [{"program": "Accounting ", "description": "The Accounting program at Brock University is run by the Goodman School of Business, and provides a successful student with a Bachelor of Accounting. Accounting at the Goodman School of Business has a national reputation for excellence. In fact, Goodman was recently re-accredited to the master’s level by Chartered Professional Accountants (CPA) Ontario under the new national CPA accreditation standards. The program is available with a co-op and includes Law Plus, Experiential Learning and International Opportunities. The expected cut-off is low 80s; Co-op mid 80s. The OUAC Code is BK. For more information, see the Accounting program webpage here: ", "website": "https://brocku.ca/goodman/programs/bacc/", "requirements": "None"}], "time": "2022-03-09 02:14:27.789125"}